ci4/app/Models/AntrianModel.php

  public function getAll()
  {
    $builder = $this->table('antrian');
    $builder->join('loket', 'antrian.loket_id = loket.id');
    $builder->join('pelayanan', 'antrian.pelayanan_id = pelayanan.id');
    $builder->select('*');
    $query = $builder->get();
---
SELECT *
FROM `antrian`
JOIN `loket` ON `antrian`.`loket_id` = `loket`.`id`
JOIN `pelayanan` ON `antrian`.`pelayanan_id` = `pelayanan`.`id`